
/******************************************************************************************************************************************************
 

   [프로젝트 소개]
   
   - Once Upon a Tower 이라는 게임에 영감을 받아 재해석한 게임 (수직 채굴 플랫포머 게임 : Vertical Mining Platformer)
   - 타이틀 화면에 나오는 고양이와 다람쥐가 들려주는 이야기로 둘이 구름 아래에 있는 플레이어가 게임 시작을 누르는 걸 보는 모션이 존재
   - 할머니가 저녁에 자기 전 아이들에게 들려주는 느낌이 드는 자장가 같은 배경음악을 타이틀 화면에 설정
   - 3D인 기사님이 어느날 2D 세계 속 탑에 갇혀 벗어나기 위해 채굴 형식으로 타일을 부셔서 해방되는 스토리 라인임
   - 세계수라는 나무 같기도 하고 거대한 문처럼도 보이는 이상의 탑 꼭대기와 그 아래에 던전 같은 탑이 게임의 메인 스테이지임
   - 게임 씬은 속도감이 있는 배경 음악을 깔아주고 드림 씬은 꿈 속에 나오는 놀이공원처럼 기묘한 기분이 드는 배경음악을 깔아준다
   - 3D인 기사는 공주님의 호위기사가 되기 위한 마지막 관문을 통과하게 되는데 그게 바로 성 밑에 존재하는 탑의 시험이었다
   - 캐릭터를 누르면 게임이 시작되고 게임 시작 전에 패널이 뜨는데 타이틀 씬으로 돌아가기랑 진행도랑 꿈꾸기랑 옵션이 있음
   - 진행도 버튼을 누르면 진행도 패널에서 최고 점수와 스토리 진행 정도를 알려주는 업적란이 뜬다
   - 드림 씬 캐릭터 부분에는 다람쥐와 햄스터라는 타이틀 씬 부분이랑 드림 씬에 나오는 3D 기사님과 적들 부분과 게임 씬에 나오는 기사님과 적들 부분이 있음
   - 게임 캐릭터에 버튼 컴포넌트를 넣어서 누르면 설명 패널이 나와서 게임의 스토리 라인을 캐릭터 설명으로 유추 가능하게 함
   - 게임에서는 공주님인 걸 기사로 바꾸는 대신 비슷한 느낌을 주기 위해서 기사님 성별을 여성으로 한정함
   - 3D 느낌이 나는 원래 게임과 차별화로 2D 느낌의 게임 씬으로만 만들어야 하나 드림 씬에는 원래 공주님 세상을 표현하기 위해 3D 에셋만 사용
   - 드림 씬에서 스토리 라인이 스크립트로 나와야 하는데 패널이 말풍선이나 패널 형식으로 하고 탭하면 스크립트가 넘어가야 함
   - 한글 폰트를 최대한 활용해서 동화책 같은 느낌으로 스토리 전개가 느껴지게 만들어야 함
   - 옵션 패널에는 최고 점수가 기록되고 점수 기반은 아이템을 얻은 정도로 결정한다
   - 옵션 패널에는 음악과 소리 효과 조절이 나온다
   - 게임이 종료되면 게임 오버 패널이 뜨는데 거기에 현재 점수를 알려주는 부분과 아이템을 내면 한 번은 이어서 하게 해주는 버튼이 있음



*************************************************************************************************************************************************************/